<?php

//  ამ ნაწილში წერთ შემოწმებას თუ ფორმა არის დასაბიმთებული და $_GET მასივის 
// ტიპის ცვლადიში გვაქვს ჩანაწერი იმ key-ზე რაც ფორმაში შეაყვანინეთ უზერს
//  <input  name='value' /> 
// input თაგში name-ის value რასაც უდრის იმ KEY-ზე გვენახება $_GET ცვალდში უზერის მიერ შეყვანილი ინფო
// რომ გაიგოთ რა ინფო არის $_GET ცვლადშ დასატესტად გამოიყენოთ
echo var_dump($_GET);
// ან
echo print_r($_GET);


// თუ ფორმა არი დასაბიმთებული და $_GET მასივში გაქვთ ველიუბი რაც უზერმა შეიყვანა 
// ეს ინფო გამოიტანეთ ეკრანზე
// და ასევე შეინახეთ ფაილში 
// მაგალით გაქვს ძალიან(თითქმის იგივეა რაც გაკვითლზე გავაკეთეთ) და რეფერენსად გამიყენოთ შეგიძლიათ არსებული კოდი

?>


<!DOCTYPE html>
<html lang="en">

<head>
    <meta charset="UTF-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>Document</title>
</head>

<body>


    <!-- შექმენით html ფორმა სადაც მომხმარებელს შეაყვანინებთ თქვენს მიერ არჩეულ ინფოს -->
    <!-- და ასევე გექნებათ დასაბიმთების ანუ ფორმის გაგზავნის ღილაკი  -->

</body>

</html>
