<?php

// შექმენით კლასი და დაარქვით Subject
// ამ კლასს უნდა ქონდეს შემდეგი პარამეტრები 
// სახელი
// მინიმალური ქულა საგნის ჩაბარებისთვის
// ლექციების რაოდნებოა საგანზე


// შემქენით ასვე ამ კლასში მეთოდები (იგივე ფუნქიცები)
// ფუნქცია რომელიც მიიღებს პარამეტრად ციფრს და დააბრუნებს true ან false იმის მიხედვით
// საკმარისია თუ არა ქულა საგნის ჩასაბარებლად

// შექმენით გეთერები და სეთერები ყველა პარამეტრისათვის

// ასევე მიიღეთ constructor-ში ყველა პარამატერი და დასეტეთ ველიუები ობექტის შექმნისას
