<?php


$numArrays = [1, 2, 3, 4, 5, 6];


// მასივის ყველა ელემენტის მნიშვნელობა გააორმაგეთ




// დაბეჭდეთ ეკრანზე მხოლოდ ლუწი რიცხვები მოცეუმლი მასივიდან



// შექმენით ფუნქცია რომელიც მიიღებს ორ პარამეტრს მასივს და keys 
// მოცემულ ქიზე თუ არ არსებობს ჩანაწერი წაშლის და დააბრუნებს ახალ მასივს
// თუ არ არსებობს დაარბუნებს false-ს
function deleteItem($array, $key){}



// დაწერეთ ფუნქცია რომელიც პირველ პარამეტრად მიიღებს რიცხვების მასივს და მეორე პარამეტრად რიცხვს
// ფუქნციამ უნდა წაშალოს ყველა რიცხვი მასივიდან რომელიც ზუსტად 
// არ გაიყოფა მეორე გამოდმოცემულ პარამეტრზე
